25-pokemon-teams-review/pokemon-teams-backend/app/controllers/pokemons_controller.rb

  def create
    trainer = Trainer.find(pokemon_params)
    # Validates for the size of the pokemons list, with a custom error message
    if trainer.pokemons.size > 5 then return render json: {error: 'Your team is full'} end
    pokemon = generate_pokemon
    pokemon.trainer = trainer
    pokemon.save
---
SELECT "trainers".* FROM "trainers" WHERE "trainers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "pokemons" WHERE "pokemons"."trainer_id" = ?  [["trainer_id", 1]]
INSERT INTO "pokemons" ("species", "nickname", "trainer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["species", "Ditto"], ["nickname", "Chrissy"], ["trainer_id", 7], ["created_at", "2019-12-16 12:53:00.981062"], ["updated_at", "2019-12-16 12:53:00.981062"]]

  def destroy
    pokemon = Pokemon.find(params[:id])
    pokemon.destroy
---
SELECT "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT ?  [["id", 132], ["LIMIT", 1]]
DELETE FROM "pokemons" WHERE "pokemons"."id" = ?  [["id", 132]]