25-pokemon-teams-review/pokemon-teams-backend/app/controllers/trainers_controller.rb

SELECT "trainers".* FROM "trainers"
---
  def index
    trainers = Trainer.all